import {createUtilsFolder} from './script.js';

(async () => {
    await createUtilsFolder();
    console.log(
        "\x1b[32m\n╔═════════════════════════════════════════════╗" +
        "\x1b[32m\n║ \x1b[35m✨ \x1b[34m██████╗ ██╗██╗   ██╗     ██╗ ███████╗\x1b[33m ✨ \x1b[32m║" +
        "\x1b[32m\n║ \x1b[33m✨ \x1b[36m██   ██ ╚═╝██║   ██║     ██║ ██╔════╝\x1b[33m ✨ \x1b[32m║" +
        "\x1b[32m\n║ \x1b[33m✨ \x1b[36m██   ██║██╗██║   ██║     ██║ ███████╗\x1b[33m ✨ \x1b[32m║" +
        "\x1b[32m\n║ \x1b[33m✨ \x1b[36m██   ██║██║██║   ██║██   ██║      ██║\x1b[33m ✨ \x1b[32m║" +
        "\x1b[32m\n║ \x1b[33m✨ \x1b[36m██████╔╝██║ ╚████╔═╝╚╗█████║ ███████║\x1b[33m ✨ \x1b[32m║" +
        "\x1b[32m\n║ \x1b[33m✨ \x1b[36m ╚════╝ ╚═╝  ╚═══╝   ╚═════╝  ╚═════╝\x1b[33m ✨ \x1b[32m║" +
        "\x1b[32m\n║           \x1b[35m❤️ Welcome to TryDivJS! ❤️    \x1b[32m      ║" +
        "\x1b[32m\n╚═════════════════════════════════════════════╝\x1b[0m\n"
      ); 
      
      console.log(
        "\x1b[90m╔" + "═".repeat(50) + "╗\x1b[0m" +
        "\n\x1b[90m║\x1b[0m      \x1b[36m♦ \x1b[1mTRYDIV\x1b[33mJS\x1b[0m \x1b[90mLibrary Initialization\x1b[0m           \x1b[90m║\x1b[0m" +
        "\n\x1b[90m╠" + "═".repeat(50) + "╣\x1b[0m" +
        "\n\x1b[90m║\x1b[0m   \x1b[32m✨ Welcome to the power of component magic!  ✨\x1b[0m\x1b[90m║\x1b[0m" +
        "\n\x1b[90m║\x1b[0m                                                  \x1b[90m║\x1b[0m" +
        "\n\x1b[90m║\x1b[0m   \x1b[34m➤\x1b[0m Library: \x1b[1m\x1b[35mTRYDIVJS\x1b[0m                            \x1b[90m║\x1b[0m" +
        "\n\x1b[90m║\x1b[0m   \x1b[34m➤\x1b[0m Creator: \x1b[1m\x1b[35mNeeraj Kumar\x1b[0m                        \x1b[90m║\x1b[0m" +
        "\n\x1b[90m║\x1b[0m                                                  \x1b[90m║\x1b[0m" +
        "\n\x1b[90m║\x1b[0m   \x1b[33m🚀 Quick Start:\x1b[0m                                \x1b[90m║\x1b[0m" +
        "\n\x1b[90m║\x1b[0m   \x1b[36mnpx trydivjs add <component_name>\x1b[0m              \x1b[90m║\x1b[0m" +
        "\n\x1b[90m╚" + "═".repeat(50) + "╝\x1b[0m\n"
    );
})();
